Rails/app/controllers/api/v1/boards_controller.rb

INSERT INTO "boards" ("topic", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["topic", "Testing"], ["created_at", 2016-08-25 18:49:10 UTC], ["updated_at", 2016-08-25 18:49:10 UTC]]
INSERT INTO "board_categories" ("category_id", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 2], ["board_id", 14], ["created_at", 2016-08-25 18:49:10 UTC], ["updated_at", 2016-08-25 18:49:10 UTC]]
---
      def create
        if params[:seedBoardInfo]
            board =Board.create(topic: params[:seedBoardInfo][:boardName])
             params[:seedBoardInfo][:categories].each do |c_id|
               BoardCategory.create(board_id:board.id , category_id: c_id.to_i)