Rails/app/controllers/api/v1/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "New Ruby Board"], ["created_at", 2016-08-25 18:13:59 UTC], ["updated_at", 2016-08-25 18:13:59 UTC]]
---
      def create
        category =Category.create(name: params[:submittedInfo][:CategoryName])