Rails/app/controllers/api/v1/game_options_controller.rb

      def create
        user = User.find(params[:boardInfo][:userId])
        game = Game.create(board_id: params[:boardInfo][:boardId].to_i, user_id: user.id, final_score: params[:boardInfo][:score])
        user.games.push(game)
        user.save

        params[:optionsInfo].each do |param|
          GameOption.create(game_id: game.id, option_id: param[:optionId], correct: param[:correct] , error: param[:error] )
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "games" ("board_id", "user_id", "final_score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["board_id", 1], ["user_id", 1], ["final_score", -7800], ["created_at", 2016-08-29 03:29:00 UTC], ["updated_at", 2016-08-29 03:29:00 UTC]]
INSERT INTO "game_options" ("game_id", "option_id", "created_at", "updated_at", "correct") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["game_id", 1], ["option_id", 17], ["created_at", 2016-08-29 03:29:00 UTC], ["updated_at", 2016-08-29 03:29:00 UTC], ["correct", false]]

      def user_analytics
        user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]