Rails/app/controllers/api/v1/options_controller.rb

INSERT INTO "options" ("question_id", "language", "correct_answer", "open", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["question_id", 36], ["language", "JS"], ["correct_answer", "Test"], ["open", true], ["created_at", 2016-08-25 19:07:27 UTC], ["updated_at", 2016-08-25 19:07:27 UTC]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
      def create
        byebug
        Option.create(option_params['options'])
        render json: Category.find(params[:options][0][:category_id])