Rails/app/controllers/api/v1/questions_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      def show
          questionObject = Question.find(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "questions" ("category_id", "difficulty", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 12], ["difficulty", 1000], ["content", ""], ["created_at", 2016-08-25 19:03:11 UTC], ["updated_at", 2016-08-25 19:03:11 UTC]]
---
      def create

        category = Category.find(params[:category_id])

        open_options = params[:open].map do |question|
          q = Question.create(content: question["oQuestionContent"] , category_id: category.id, difficulty: question["score"] )