Rails/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("password_digest", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["password_digest", "$2a$10$4inxTYJjL7UXTThUqG8JNOL93elbyPGgnbmgfTitekzzj6eoPJkfm"], ["created_at", 2016-08-28 21:29:02 UTC], ["updated_at", 2016-08-28 21:29:02 UTC], ["email", "test"]]
---
      def create
        user = User.create(email: params[:email], password: params[:password])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        # byebug
        user = User.find(params[:id])