app/controllers/api/v1/boards_controller.rb

SELECT "boards".* FROM "boards"
---
      def index
        render json: Board.all