app/controllers/api/v1/options_controller.rb

      def index
        render json: Option.all
---
SELECT "options".* FROM "options"